from rldd.client import Client
from rldd import config
import re

dps = Client(config.DPS, "dps").connect()
persons = dps["xxx_rpgu_persons"].find()

regions = {
    "Балаш": "117",
    "Мытищ": "117",
    "Реутов": "117",

    "Долгопр": "118",
    "Дубн": "118",
    "Лобн": "118",
    "Талдом": "118",
    "Дмитр": "118",
    "Лунев": "118",
    "Химк": "118",

    "Колом": "119",
    "Воскресен": "119",
    "Егорьевск": "119",
    "Зарайск": "119",
    "Луховиц": "119",
    "Серебрян": "119",

    "Восход": "120",
    "Волоколамск": "120",
    "Истринск": "120",
    "Клинск": "120",
    "Красногорск": "120",
    "Лотошин": "120",
    "Андреев": "120",
    "Кривцов": "120",
    "Кутузов": "120",
    "Менделеев": "120",
    "Пешковск": "120",
    "Поваров": "120",
    "Ржавк": "120",
    "Смирновск": "120",
    "Соколовск": "120",
    "Солнечногорск": "120",
    "Шаховск": "120",

    "Бронниц": "121",
    "Дзержинск": "121",
    "Жуковск": "121",
    "Котельн": "121",
    "Любер": "121",
    "Раменс": "121",

    "Власих": "122",
    "Звенигород": "122",
    "Краснознаменск": "122",
    "Молодеж": "122",
    "Можайск": "122",
    "Наро-": "122",
    "Одинцов": "122",
    "Руз": "122",

    "Орехово-": "123",
    "Рошал": "123",
    "Электрогорск": "123",
    "Электростал": "123",
    "Павлово-": "123",
    "Шатур": "123",

    "Домодедов": "124",
    "Лыткар": "124",
    "Подольск": "124",
    "Ленин": "124",

    "Королев": "125",
    "Красноармейск": "125",
    "Пушкин": "125",
    "Сергиев": "125",

    "Кашир": "126",
    "Озер": "126",
    "Протвин": "126",
    "Пущин": "126",
    "Серпухов": "126",
    "Ступ": "126",
    "Чехов": "126",

    "Звезд": "127",
    "Ивантеев": "127",
    "Лосино": "127",
    "Фрязин": "127",
    "Черноголов": "127",
    "Ногинск": "127",
    "Щелков": "127",
}
iteration = 0
for person in persons:
    try:
        iteration += 1
        print(iteration)
        for elem in regions:
            result = re.search(elem, person["locationAddress"])
            if result:
                upd = dps["xxx_rpgu_persons"].update_one({"_id": person["_id"]}, {
                    "$set": {
                        "regionCode": regions[result.group(0)]
                    }
                })
                print(person["_id"], upd.modified_count)
                break
    except TypeError as t:
        print(person["_id"], t)
        continue
